In [23]:
# Import the required libraries and dependencies
import numpy as np
import pandas as pd
from pathlib import Path
import pandas as pd
import pycountry_convert as pc
import os

In [2]:
#create a path object and specify the filename
df1 = pd.read_csv(Path("../resources/lifeExpectancy.csv"))
df2 = pd.read_csv(Path("../resources/CountryHappinessRank.csv"))

In [3]:
df1.head()

,Country Name,Country Code,Region,IncomeGroup,Year,Life Expectancy World Bank,Prevelance of Undernourishment,CO2,Health Expenditure %,Education Expenditure %,Unemployment,Corruption,Sanitation,Injuries,Communicable,NonCommunicable
0,Afghanistan,AFG,South Asia,Low income,2001,56.308,47.8,730.0,NaN,NaN,10.809000,NaN,NaN,2179727.10,9689193.70,5795426.38
1,Angola,AGO,Sub-Saharan Africa,Lower middle income,2001,47.059,67.5,15960.0,4.483516,NaN,4.004000,NaN,NaN,1392080.71,11190210.53,2663516.34
2,Albania,ALB,Europe & Central Asia,Upper middle income,2001,74.288,4.9,3230.0,7.139524,3.4587,18.575001,NaN,40.520895,117081.67,140894.78,532324.75
3,Andorra,AND,Europe & Central Asia,High income,2001,NaN,NaN,520.0,5.865939,NaN,NaN,NaN,21.788660,1697.99,695.56,13636.64
4,United Arab Emirates,ARE,Middle East & North Africa,High income,2001,74.544,2.8,97200.0,2.484370,NaN,2.493000,NaN,NaN,144678.14,65271.91,481740.70

In [4]:
df2.head()

,Country,Region,Happiness Rank,Happiness Score,Standard Error,Economy (GDP per Capita),Family,Health (Life Expectancy),Freedom,Trust (Government Corruption),Generosity,Dystopia Residual
0,Switzerland,Western Europe,1,7.587,0.03411,1.39651,1.34951,0.94143,0.66557,0.41978,0.29678,2.51738
1,Iceland,Western Europe,2,7.561,0.04884,1.30232,1.40223,0.94784,0.62877,0.14145,0.43630,2.70201
2,Denmark,Western Europe,3,7.527,0.03328,1.32548,1.36058,0.87464,0.64938,0.48357,0.34139,2.49204
3,Norway,Western Europe,4,7.522,0.03880,1.45900,1.33095,0.88521,0.66973,0.36503,0.34699,2.46531
4,Canada,North America,5,7.427,0.03553,1.32629,1.32261,0.90563,0.63297,0.32957,0.45811,2.45176

In [5]:
df2.shape

(158, 12)

In [6]:
df1.shape

(3306, 16)

In [7]:
df1.dtypes

Country Name                       object
Country Code                       object
Region                             object
IncomeGroup                        object
Year                                int64
Life Expectancy World Bank        float64
Prevelance of Undernourishment    float64
CO2                               float64
Health Expenditure %              float64
Education Expenditure %           float64
Unemployment                      float64
Corruption                        float64
Sanitation                        float64
Injuries                          float64
Communicable                      float64
NonCommunicable                   float64
dtype: object

**1. Data Restructuring and Column Name Standardization**

In [8]:
#remove unnecessary column or duplicated
df1 = df1.drop(columns = ['Communicable', 'NonCommunicable', 'Injuries', 'Country Code'])
df2 = df2.drop(columns=['Standard Error', 'Health (Life Expectancy)', 'Dystopia Residual', 'Region', 'Health (Life Expectancy)'])

In [9]:
df1.isnull().sum()

Country Name                         0
Region                               0
IncomeGroup                          0
Year                                 0
Life Expectancy World Bank         188
Prevelance of Undernourishment     684
CO2                                152
Health Expenditure %               180
Education Expenditure %           1090
Unemployment                       304
Corruption                        2331
Sanitation                        1247
dtype: int64

In [10]:
#rename columns
df1 = df1.rename(columns ={'Country Name': 'country','Region': 'region', 'IncomeGroup' : 'income_group', 'Year' : 'year','Prevelance of Undernourishment' : 'undernourishment', 'Life Expectancy World Bank' : 'life_expectancy', 'Health Expenditure %' : 'health_expenditure', 'Unemployment' : 'unemployment'
                           , 'Education Expenditure %' : 'education_expenditure', 'Sanitation' : 'sanitation'})
df2 =df2.rename(columns ={'Country' : 'country' , 'Happiness Rank': 'happiness_rank','Happiness Score': 'happiness_score', 'Economy (GDP per Capita)' : 'GDP', 'Family' : 'family', 'Freedom' : 'freedom', 
                          'Trust (Government Corruption)': 'government_trust', 'Generosity': 'generosity'})

**2. Missing data**

In [11]:
#checking null percentage, remove column that has more than 50% nulls
column_1 = 'Corruption'
null_count = df1['Corruption'].isnull().sum()
total_rows = len(df1)
percentage_null_1 = (null_count/total_rows) *100
print(f"the percentage null of {column_1} column is {percentage_null_1}")
      
column_2 = 'Sanitation'
null_count = df1['sanitation'].isnull().sum()
total_rows = len(df1)
percentage_null_2 = (null_count/total_rows) *100
print(f"the percentage null of {column_2} column is {percentage_null_2}")
      
column_3 = 'Education Expenditure' 
null_count = df1['education_expenditure'].isnull().sum()
total_rows = len(df1)
percentage_null_3 = (null_count/total_rows) *100
print(f"the percentage null of {column_3} column is {percentage_null_3}")

the percentage null of Corruption column is 70.508166969147
the percentage null of Sanitation column is 37.719298245614034
the percentage null of Education Expenditure column is 32.97035692679976

In [12]:
df1 = df1.drop(columns = ['Corruption'])

In [13]:
df2.isnull().sum()

country             0
happiness_rank      0
happiness_score     0
GDP                 0
family              0
freedom             0
government_trust    0
generosity          0
dtype: int64

## **3. Data Transformation**

**Country Dimension**

In [14]:
#check if all countries in df1 exist in df2
result = df1['country'].isin(df2['country']).all()
result

False

In [15]:
#creating new table of unique country 
combined_df = pd.concat([df1['country'],df2['country']],ignore_index = True)
country_id = pd.DataFrame({'country': combined_df}).drop_duplicates()
country_id

                   country
0              Afghanistan
1                   Angola
2                  Albania
3                  Andorra
4     United Arab Emirates
...                    ...
3440                 Egypt
3441                 Yemen
3444   Congo (Brazzaville)
3456           Ivory Coast
3461                 Syria

[197 rows x 1 columns]

In [16]:
country_dim = country_id[['country']].reset_index(drop= True)
country_dim['country_id'] = country_dim.index

In [17]:
#assign country with country_id
#match the country with continent_id
df1 = df1.merge(country_dim, on='country', how = 'left')
df2 = df2.merge(country_dim, on='country', how = 'left')
df1.head()

,country,region,income_group,year,life_expectancy,undernourishment,CO2,health_expenditure,education_expenditure,unemployment,sanitation,country_id
0,Afghanistan,South Asia,Low income,2001,56.308,47.8,730.0,NaN,NaN,10.809000,NaN,0
1,Angola,Sub-Saharan Africa,Lower middle income,2001,47.059,67.5,15960.0,4.483516,NaN,4.004000,NaN,1
2,Albania,Europe & Central Asia,Upper middle income,2001,74.288,4.9,3230.0,7.139524,3.4587,18.575001,40.520895,2
3,Andorra,Europe & Central Asia,High income,2001,NaN,NaN,520.0,5.865939,NaN,NaN,21.788660,3
4,United Arab Emirates,Middle East & North Africa,High income,2001,74.544,2.8,97200.0,2.484370,NaN,2.493000,NaN,4

In [37]:
file_name_5 = 'country_dim.csv'
folder_path = os.path.join(r'C:\Users', 'hhn19','OneDrive', 'Documents','projectsql', 'resources')
file_path_5 = f'{folder_path}/{file_name_5}'
country_dim.to_csv(file_path_5, index=False)

**Region Dimension**

In [18]:
# due to difference in region format, region table will use python library as standardization across region (continent) column 
# Function to get the continent for a given country
def get_continent(country_name):
    try:
        country_code = pc.country_name_to_country_alpha2(country_name, cn_name_format="default")
        continent_code = pc.country_alpha2_to_continent_code(country_code)
        
        continent_mapping = {
            'AF': 'Africa',
            'AS': 'Asia',
            'EU': 'Europe',
            'NA': 'North America',
            'SA': 'South America',
            'OC': 'Oceania',
            'AN': 'Antarctica',
        }
        
        continent = continent_mapping.get(continent_code, "Unknown")
        return continent
    except:
        return "Unknown"


region = pd.DataFrame()
region['continent'] = country_dim['country'].apply(get_continent)
temp_df = region['continent'].unique()
region_dim =pd.DataFrame({'continent' : temp_df})
region_dim['continent_id'] = region_dim.index
region_dim

       continent  continent_id
0           Asia             0
1         Africa             1
2         Europe             2
3  South America             3
4        Oceania             4
5  North America             5
6        Unknown             6

In [19]:
#apply continent function to original dataframe
df1['continent'] = df1['country'].apply(get_continent)
df2['continent'] = df2['country'].apply(get_continent)

#match the country with continent_id
df1_merged = df1.merge(region_dim, on='continent', how = 'left')
df2_merged = df2.merge(region_dim, on='continent', how = 'left')
df1_merged =df1_merged.drop(columns = 'continent')
df2_merged = df2_merged.drop(columns= 'continent')
df1_merged.head()

,country,region,income_group,year,life_expectancy,undernourishment,CO2,health_expenditure,education_expenditure,unemployment,sanitation,country_id,continent_id
0,Afghanistan,South Asia,Low income,2001,56.308,47.8,730.0,NaN,NaN,10.809000,NaN,0,0
1,Angola,Sub-Saharan Africa,Lower middle income,2001,47.059,67.5,15960.0,4.483516,NaN,4.004000,NaN,1,1
2,Albania,Europe & Central Asia,Upper middle income,2001,74.288,4.9,3230.0,7.139524,3.4587,18.575001,40.520895,2,2
3,Andorra,Europe & Central Asia,High income,2001,NaN,NaN,520.0,5.865939,NaN,NaN,21.788660,3,2
4,United Arab Emirates,Middle East & North Africa,High income,2001,74.544,2.8,97200.0,2.484370,NaN,2.493000,NaN,4,0

In [36]:
file_name_4 = 'region_dim.csv'
folder_path = os.path.join(r'C:\Users', 'hhn19','OneDrive', 'Documents','projectsql', 'resources')
file_path_4 = f'{folder_path}/{file_name_4}'
region_dim.to_csv(file_path_4, index=False)

**Income Group Dimension**

In [20]:
#creating new table for income group dimension only for df1 as df2 table dont have income group informatuib
temp_df = df1['income_group'].unique()
income_group_dim = pd.DataFrame({'income_group' : temp_df})
income_group_dim['income_group_id'] = income_group_dim.index
#match country with income_group_id
df1_merged = df1_merged.merge(income_group_dim, on='income_group', how = 'left')
df1_merged = df1_merged.drop(columns = 'income_group')

In [21]:
df1_merged = df1_merged.drop(columns = ['country', 'region'])
df2_merged = df2_merged.drop(columns = ['country'])

In [35]:
file_name_3 = 'income_dim.csv'
folder_path = os.path.join(r'C:\Users', 'hhn19','OneDrive', 'Documents','projectsql', 'resources')
file_path_3 = f'{folder_path}/{file_name_3}'
income_group_dim.to_csv(file_path_3, index=False)

In [28]:
file_name_1 = 'life_expectancy.csv'
file_name_2 = 'happiness_rank.csv'
folder_path = os.path.join(r'C:\Users', 'hhn19','OneDrive', 'Documents','projectsql', 'resources')
file_path_1 = f'{folder_path}/{file_name_1}'
file_path_2 = f'{folder_path}/{file_name_2}'
df1_merged.to_csv(file_path_1, index=False) 
df2_merged.to_csv(file_path_2, index = False)